# RbsPipeFrictionFactorParam Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ParameterTypeId..::..RbsPipeFrictionFactorParam Property
ParameterTypeId Class See Also
---
"Friction Factor"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsPipeFrictionFactorParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsPipeFrictionFactorParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsPipeFrictionFactorParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace